In [1]:
#Individual data analysis will be here

In [2]:
import pandas as pd
from scripts import project_functions as pf

In [3]:
# Load data from National Names
national_df = pd.read_csv('../../data/raw/national/NationalNames.csv')
national_df. head(10)

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746
5   6   Margaret  1880      F   1578
6   7        Ida  1880      F   1472
7   8      Alice  1880      F   1414
8   9     Bertha  1880      F   1320
9  10      Sarah  1880      F   1288

In [4]:
national_df.describe().T

,count,mean,std,min,25%,50%,75%,max
Id,1825433.0,912717.000000,526957.261306,1.0,456359.0,912717.0,1369075.0,1825433.0
Year,1825433.0,1972.619783,33.528912,1880.0,1949.0,1982.0,2001.0,2014.0
Count,1825433.0,184.687921,1566.710979,5.0,7.0,12.0,32.0,99680.0

In [5]:
state_df = pf.load_and_process_many("../../data/raw/state")

In [6]:
state_df.head(10)

       Name  Year Gender State  Count
0      Mary  1910      F    AK     14
1     Annie  1910      F    AK     12
2      Anna  1910      F    AK     10
3  Margaret  1910      F    AK      8
4     Helen  1910      F    AK      7
5     Elsie  1910      F    AK      6
6      Lucy  1910      F    AK      6
7   Dorothy  1910      F    AK      5
8      Mary  1911      F    AK     12
9  Margaret  1911      F    AK      7

In [7]:
# See if there is any missing value
state_df.isnull().sum()

Name      0
Year      0
Gender    0
State     0
Count     0
dtype: int64

In [8]:
# Overview of the dataset
state_df.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,5647426.0,1972.391787,29.573899,1910.0,1949.0,1977.0,1999.0,2014.0
Count,5647426.0,52.923814,180.810001,5.0,7.0,13.0,34.0,10023.0

In [9]:
state_df.dtypes

Name      object
Year       int64
Gender    object
State     object
Count      int64
dtype: object

### Research Questions 

RQ1: Compare the Western and Southern states of the US, What is the most and least popular Girls Name from 2000-2014?

RQ2: What is the most and least popular Girls Name from 1910-1925 in Western & Southern states?

RQ3: Compare the two time frames:Is there any similarity and differences?

In [10]:
# We cateogroize the southern states as following:
pf.SOUTH

['AL',
 'AR',
 'DC',
 'DE',
 'FL',
 'GA',
 'KY',
 'LA',
 'MD',
 'MS',
 'NC',
 'OK',
 'SC',
 'TN',
 'TX',
 'VA',
 'WV']

In [11]:
# Cateogorize WESTERN states as following:
pf.WEST

['AK', 'AZ', 'CA', 'CO', 'HI', 'ID', 'MT', 'NM', 'NV', 'OR', 'UT', 'WA', 'WY']

In [16]:
state_df.sort_values(by= ['Count'], ascending=False)

             Name  Year Gender State  Count
3772924    Robert  1947      M    NY  10023
3772925      John  1947      M    NY   9634
3772219    Robert  1946      M    NY   9296
3787355   Michael  1963      M    NY   9250
3776828    Robert  1952      M    NY   9208
...           ...   ...    ...   ...    ...
1591671      Puja  1984      F    IL      5
1591672     Rakia  1984      F    IL      5
1591673  Rashanda  1984      F    IL      5
1591674     Reena  1984      F    IL      5
5647425    Waylon  2014      M    WY      5

[5647426 rows x 5 columns]

In [15]:
state_df_2000s = state_df[state_df["Year"] > 1999]
state_df_2000s

            Name  Year Gender State  Count
10543     Hannah  2000      F    AK     58
10544    Madison  2000      F    AK     50
10545      Emily  2000      F    AK     48
10546      Sarah  2000      F    AK     39
10547     Ashley  2000      F    AK     36
...          ...   ...    ...   ...    ...
5647421     Seth  2014      M    WY      5
5647422  Spencer  2014      M    WY      5
5647423     Tyce  2014      M    WY      5
5647424   Victor  2014      M    WY      5
5647425   Waylon  2014      M    WY      5

[1343724 rows x 5 columns]

In [22]:
state_df_2000s.sort_values(by= ['Count'], ascending=False).iloc[:5]

          Name  Year Gender State  Count
668356  Daniel  2000      M    CA   4340
678593  Daniel  2004      M    CA   4167
670872  Daniel  2001      M    CA   4164
673414  Daniel  2002      M    CA   4130
675966  Daniel  2003      M    CA   4032